Repository: get-translated/ios-sdk
Catalog: sample-app/GetTranslatedSample/GetTranslatedSample/*.lproj/Localizable.strings
Languages: es, ja

# app.title
source: GetTranslated SDK Sample
es: Ejemplo de SDK de GetTranslated
ja: GetTranslated SDKサンプル

# default.translation_input
source: Hello, World!
es: ¡Hola, Mundo!
ja: こんにちは、世界！

# language.management.current_language
source: Current Language: %@
es: Idioma actual: %@
ja: 現在の言語: %@

# language.management.current_language.default
source: Current Language: en
es: Idioma actual: en
ja: 現在の言語: en

# language.management.enter_language_code
source: Please enter a language code
es: Por favor, ingrese un código de idioma
ja: 言語コードを入力してください

# language.management.language_code.placeholder
source: Language Code (e.g., es, fr, de)
es: Código de idioma (por ejemplo, es, fr, de)
ja: 言語コード (例: es, fr, de)

# language.management.language_set_success
source: Language set successfully: %@
es: Idioma configurado con éxito: %@
ja: 言語が正常に設定されました: %@

# language.management.languages_loaded
source: Languages loaded: %d
es: Idiomas cargados: %d
ja: 読み込まれた言語: %d

# language.management.languages_refreshed
source: Languages refreshed: %d languages
es: Idiomas actualizados: %d idiomas
ja: 言語が更新されました: %d 言語

# language.management.no_languages_warning
source: WARNING: No languages loaded from server
es: ADVERTENCIA: No se cargaron idiomas del servidor
ja: 警告: サーバーから言語が読み込まれていません

# language.management.set_language
source: Set Language
es: Establecer idioma
ja: 言語を設定

# language.management.setting_language
source: Setting language to: %@
es: Configurando el idioma a: %@
ja: 言語を設定中: %@

# language.management.supported_languages.format
source: Available Languages (%d): %@
es: Idiomas disponibles (%d): %@
ja: 利用可能な言語 (%d): %@

# language.management.supported_languages.loading
source: Supported Languages: Loading…
es: Idiomas soportados: Cargando…
ja: サポートされている言語: 読み込み中…

# language.management.supported_languages.none
source: Available Languages: None loaded
es: Idiomas disponibles: Ninguno cargado
ja: 利用可能な言語: 読み込まれていません

# language.management.title
source: Language Management
es: Gestión de idiomas
ja: 言語管理

# log.output.clear
source: Clear Log
es: Borrar registro
ja: ログをクリア

# log.output.title
source: Log Output
es: Salida de registro
ja: ログ出力

# button.exit
source: Exit App
es: Salir de la aplicación
ja: アプリを終了

# plural.testing.count
source: Count: %d
es: Conteo: %d
ja: カウント: %d

# plural.testing.description
source: Plural forms for different counts:
es: Formas plurales para diferentes cantidades:
ja: 異なるカウントの複数形:

# plural.testing.items
source: %d items
es: %d elementos
ja: %d アイテム

# plural.testing.no_items
source: No items
es: Sin elementos
ja: アイテムがありません

# plural.testing.not_initialized
source: SDK not initialized yet
es: SDK no inicializado aún
ja: SDKはまだ初期化されていません

# plural.testing.one_item
source: 1 item
es: 1 elemento
ja: 1 アイテム

# plural.testing.title
source: Plural Testing
es: Pruebas de plural
ja: 複数形テスト

# sdk.init.api_key
source: Current API Key: %@
es: Clave API actual: %@
ja: 現在のAPIキー: %@

# sdk.init.api_key.not_configured
source: API key not configured. Please set GetTranslatedAPIKey in Info.plist or GETTRANSLATED_API_KEY environment variable.
es: Clave API no configurada. Por favor, establece GetTranslatedAPIKey en Info.plist o la variable de entorno GETTRANSLATED_API_KEY.
ja: APIキーが設定されていません。Info.plistにGetTranslatedAPIKeyを設定するか、GETTRANSLATED_API_KEY環境変数を設定してください。

# sdk.init.api_key.not_set
source: NOT SET
es: NO ESTABLECIDO
ja: 未設定

# sdk.init.available_languages
source: Available languages (%d):
es: Idiomas disponibles (%d):
ja: 利用可能な言語 (%d):

# sdk.init.custom_server
source: Using custom server: %@
es: Usando servidor personalizado: %@
ja: カスタムサーバーを使用中: %@

# sdk.init.error.check_permissions
source: → Check API key permissions in your GetTranslated dashboard
es: → Verifica los permisos de la clave API en tu panel de GetTranslated
ja: → GetTranslatedダッシュボードでAPIキーの権限を確認してください

# sdk.init.error.code
source: Error Code: %d
es: Código de error: %d
ja: エラーコード: %d

# sdk.init.error.invalid_key
source: → Invalid API key. Check your API key in Info.plist
es: → Clave API inválida. Verifica tu clave API en Info.plist
ja: → 無効なAPIキー。Info.plistでAPIキーを確認してください

# sdk.init.error.message
source: Error Message: %@
es: Mensaje de error: %@
ja: エラーメッセージ: %@

# sdk.init.error.network
source: → Network error. Check your internet connection.
es: → Error de red. Verifica tu conexión a internet.
ja: → ネットワークエラー。インターネット接続を確認してください。

# sdk.init.error.permission_denied
source: → Permission denied. API key lacks required permissions.
es: → Permiso denegado. La clave API carece de los permisos requeridos.
ja: → 権限が拒否されました。APIキーに必要な権限がありません。

# sdk.init.error.server
source: → Server error. Please try again later.
es: → Error del servidor. Por favor, intenta de nuevo más tarde.
ja: → サーバーエラー。後でもう一度お試しください。

# sdk.init.failed
source: ✗ SDK initialization failed
es: ✗ Falló la inicialización del SDK
ja: ✗ SDKの初期化に失敗しました

# sdk.init.initializing
source: Initializing GetTranslated SDK…
es: Inicializando SDK de GetTranslated…
ja: GetTranslated SDKを初期化中…

# sdk.init.started
source: SDK Sample App Started
es: Aplicación de muestra del SDK iniciada
ja: SDKサンプルアプリが開始されました

# sdk.init.success
source: ✓ SDK initialized successfully
es: ✓ SDK inicializado con éxito
ja: ✓ SDKが正常に初期化されました

# sdk.status.failed
source: SDK Initialization Failed
es: Fallo en la inicialización del SDK
ja: SDKの初期化に失敗しました

# sdk.status.failed.api_key
source: Failed: API key not configured
es: Fallido: clave API no configurada
ja: 失敗: APIキーが設定されていません

# sdk.status.initialized
source: SDK Initialized Successfully
es: SDK inicializado con éxito
ja: SDKが正常に初期化されました

# sdk.status.initializing
source: Initializing…
es: Inicializando…
ja: 初期化中…

# sdk.status.title
source: SDK Status
es: Estado del SDK
ja: SDKの状態

# translation.testing.enter_text
source: Please enter text to translate
es: Por favor, ingrese el texto a traducir
ja: 翻訳するテキストを入力してください

# translation.testing.error.init_not_complete
source: → SDK initialization may not have completed yet
es: → La inicialización del SDK puede que no se haya completado aún
ja: → SDKの初期化がまだ完了していない可能性があります

# translation.testing.error.not_initialized
source: ERROR: %@
ja: エラー: %@

# translation.testing.error.permission_denied
source: → Permission denied - check API key permissions
es: → Permiso denegado - verifica los permisos de la clave API
ja: → 権限が拒否されました - APIキーの権限を確認してください

# translation.testing.error.server_error
source: → Server error - check API key and permissions
es: → Error del servidor - verifica la clave API y los permisos
ja: → サーバーエラー - APIキーと権限を確認してください

# translation.testing.error.unauthorized
source: → Unauthorized - invalid API key
es: → No autorizado - clave API inválida
ja: → 認証されていません - 無効なAPIキー

# translation.testing.error.wait_for_init
source: → Wait for 'SDK Initialized Successfully' message
es: → Espera el mensaje 'SDK inicializado con éxito'
ja: → 'SDKが正常に初期化されました'メッセージを待ってください

# translation.testing.input.placeholder
source: Text to translate
es: Texto a traducir
ja: 翻訳するテキスト

# translation.testing.not_initialized
source: SDK not initialized yet. Please wait for initialization to complete.
es: SDK aún no inicializado. Por favor, espere a que se complete la inicialización.
ja: SDKはまだ初期化されていません。初期化が完了するまでお待ちください。

# translation.testing.no_translation
source: No translation yet
es: Sin traducción aún
ja: まだ翻訳されていません

# translation.testing.result
source: Result:
es: Resultado:
ja: 結果:

# translation.testing.title
source: Translation Testing
es: Pruebas de traducción
ja: 翻訳テスト

# translation.testing.translate
source: Translate
es: Traducir
ja: 翻訳

# translation.testing.translating
source: Translating…
es: Traduciendo…
ja: 翻訳中…

# translation.testing.translating_text
source: Translating text: %@
es: Traduciendo texto: %@
ja: テキストを翻訳中: %@

# translation.testing.translation_error
source: ✗ Translation error: %@
es: ✗ Error de traducción: %@
ja: ✗ 翻訳エラー: %@

# translation.testing.translation_failed
source: Translation failed: %@
es: La traducción falló: %@
ja: 翻訳に失敗しました: %@

# translation.testing.translation_received
source: ✓ Translation received: %@
es: ✓ Traducción recibida: %@
ja: ✓ 翻訳を受信しました: %@

# user.management.anonymous
source: Anonymous
es: Anónimo
ja: 匿名

# user.management.current_user
source: Current User: %@
es: Usuario actual: %@
ja: 現在のユーザー: %@

# user.management.enter_user_id
source: Please enter a user ID
es: Por favor, ingrese un ID de usuario
ja: ユーザーIDを入力してください

# user.management.logging_in
source: Logging in user: %@
es: Iniciando sesión del usuario: %@
ja: ユーザーをログイン中: %@

# user.management.logging_out
source: Logging out user
es: Cerrando sesión del usuario
ja: ユーザーをログアウト中

# user.management.login
source: Login
es: Iniciar sesión
ja: ログイン

# user.management.login_failed
source: ✗ Login re-initialization failed
es: ✗ Falló la re-inicialización de sesión
ja: ✗ ログインの再初期化に失敗しました

# user.management.login_success
source: ✓ User logged in successfully: %@
es: ✓ Usuario iniciado sesión con éxito: %@
ja: ✓ ユーザーが正常にログインしました: %@

# user.management.logout
source: Logout
es: Cerrar sesión
ja: ログアウト

# user.management.logout_failed
source: ✗ Logout re-initialization failed
es: ✗ Falló la re-inicialización de cierre de sesión
ja: ✗ ログアウトの再初期化に失敗しました

# user.management.logout_success
source: ✓ User logged out successfully
es: ✓ Usuario cerrado sesión con éxito
ja: ✓ ユーザーが正常にログアウトしました

# user.management.title
source: User Management
es: Gestión de usuarios
ja: ユーザー管理

# user.management.user_id.placeholder
source: User ID
es: ID de usuario
ja: ユーザーID
